app/Services/BrandService.php

    public function getAllBrands()
    {
        $brandData = Brand::with('translations')
                    ->get()
                    ->map(function($brand){
                        return [
                            'id'=>$brand->id,
                            'slug'=>$brand->slug,
                            'is_active'=>$brand->is_active,
                            'brand_logo'=> isset($brand->brand_logo) && file_exists(public_path($brand->brand_logo)) ? asset($brand->brand_logo) : 'https://dummyimage.com/50x50/000000/0f6954.png&text=Brand',
                            'brand_name'=>$brand->translation->brand_name,
                        ];
                    });
---
select * from `brands` order by `is_active` desc, `id` desc

    public function getBrandsWhereInIds($ids)
    {

        $data = Brand::with('translations')->whereIn('id',$ids)
                ->where('is_active',1)
                ->orderBy('is_active','DESC')
                ->orderBy('id','DESC')
                ->get()
                ->map(function($brand){
                    return [
                        'id'=>$brand->id,
                        'slug'=>$brand->slug,
                        'is_active'=>$brand->is_active,
                        'brand_logo'=>$brand->brand_logo ?? null,
                        'brand_name'=>$brand->translation->brand_name,
                    ];
                });
---
select * from `brands` where `id` in ('1', '2') and `is_active` = 1 order by `is_active` desc, `id` desc