app/Services/CategoryService.php

    public function dataTable()
    {
        $categories = $this->getAllCategories();

        return datatables()->of($categories)
                ->setRowId(function ($category){
                    return $category->id;
                })
                ->addColumn('category_image', function ($row){
                    if ($row->image==null) {
                        return '<img src="'.url("public/images/empty.jpg").'" alt="" height="50px" width="50px">';
                    }
                    else {
                        if (!File::exists(public_path($row->image))) {
                            $url = 'https://dummyimage.com/50x50/000000/0f6954.png&text=Category';
                        }else {
                            $url = url("public/".$row->image);
                        }
                        return  '<img src="'. $url .'" height="50px" width="50px"/>';
                    }
                })
                ->addColumn('category_name', function ($row){
                    return $row->category_name;
                })
                ->addColumn('parent', function ($row){
                    return $row->parent_category_name;
                })
                ->addColumn('is_active', function ($row){
                    if($row->is_active==1){
                        return '<span class="p-2 badge badge-success">Active</span>';
                    }else{
                        return '<span class="p-2 badge badge-danger">Inactive</span>';
                    }
                })
                ->addColumn('action', function ($row){
---
select * from `categories` where 0 = 1 and `categories`.`deleted_at` is null