app/Services/CategoryService.php

select `categories`.`id`, `categories`.`slug`, `categories`.`image`, `categories`.`is_active`, `category_translations`.`category_name` from `categories` left join `category_translations` on `categories`.`id` = `category_translations`.`category_id` and (`category_translations`.`locale` = 'en' or `category_translations`.`locale` = 'en') order by `categories`.`is_active` desc, `categories`.`id` asc
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null order by `is_active` desc, `id` asc
select * from `category_translations` where `category_translations`.`category_id` in (1, 2, 3, 5, 7, 8, 11, 14, 15) and `category_translations`.`deleted_at` is null
---
    public function getAllCategories()
    {
        // if (request()->routeIs('specific.route.name')) {
        if (!$this->wordCheckInURL('categories')) {
            $locale = Session::has('currentLocale') ? Session::get('currentLocale') : app()->getLocale();
            return DB::table('categories')
                ->select('categories.id', 'categories.slug', 'categories.image', 'categories.is_active', 'category_translations.category_name')
                ->leftJoin('category_translations', function ($join) use ($locale) {
                    $join->on('categories.id', '=', 'category_translations.category_id')
                        ->where(function ($query) use ($locale) {
                            $query->where('category_translations.locale', $locale)
                                ->orWhere('category_translations.locale', 'en');
                        });
                })
                ->orderBy('categories.is_active', 'DESC')
                ->orderBy('categories.id', 'ASC')
                ->get();
        }



        $categories = Category::with(['translations','parentCategory.translations'])
            // ->where('parent_id', null)
            ->orderBy('is_active','DESC')
            ->orderBy('id','ASC')
            ->get()
            ->map(function($category) {
                return [
                    'id'=> $category->id,
                    'image'=> $category->image,
                    'is_active'=> $category->is_active,
                    'category_name'=> $category->translation->category_name,
                    'parent_category_name'=> $category->parentTranslation->category_name ?? 'NONE',
                ];
            });