app/Services/ProductService.php

    private function getProduct(string $slug)
    {
        return Product::with([
            'categories:id,slug,name',
            'brand:id,slug,name',
            'tags:id,slug,name',
            'baseImage'=> function ($query){
                $query->where('type','base')
                    ->first();
            },
            'additionalImage'=> function ($query){
                $query->where('type','additional')
                    ->get();
            },
            'attributes' => function ($q) {
                $q->select('id', 'name')
                  ->with(['attributeValues:id,attribute_id,name']);
            }
            // 'attributes:id,name',
            // 'attributes.attributeValues:id,attribute_id,name'
            ])
            ->where('slug',$slug)
            ->first();
---
select `id`, `attribute_id`, `name` from `attribute_values` where `attribute_values`.`attribute_id` in (1, 2, 26)
select `id`, `slug`, `name` from `brands` where `brands`.`id` in (2)

    private function getReviews(int $productId)
    {
        return DB::table('reviews')
            ->join('users', 'users.id', 'reviews.user_id')
            ->where('product_id', $productId)
            ->where('status', 'approved')
            ->whereNull('reviews.deleted_at')
            ->select(
                'users.id AS userId',
                DB::raw("CONCAT(users.first_name, ' ', users.last_name) AS name"),
                'users.image',
                'reviews.comment',
                'reviews.rating',
                'reviews.status',
                'reviews.created_at'
            )
            ->get()
            ->map(function($item){
                $item->created_at = date('d M, Y', strtotime($item->created_at));
                return $item;
            });
---
select `users`.`id` as `userId`, CONCAT(users.first_name, ' ', users.last_name) AS name, `users`.`image`, `reviews`.`comment`, `reviews`.`rating`, `reviews`.`status`, `reviews`.`created_at` from `reviews` inner join `users` on `users`.`id` = `reviews`.`user_id` where `product_id` = 4 and `status` = 'approved' and `reviews`.`deleted_at` is null

    private function getCategoryWiseProducts(int $categoryId)
    {
        $category = Category::with([
            'products.baseImage',
            'products.additionalImage'
        ])
        ->find($categoryId);
---
select * from `categories` where `categories`.`id` = 1 and `categories`.`deleted_at` is null limit 1
select `products`.*, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`product_id` as `pivot_product_id` from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `category_product`.`category_id` in (1) and `products`.`deleted_at` is null