app/Http/Controllers/API/FooterController.php

    public function storefrontFooterData()
    {
        $settingNewslatter = SettingNewsletter::first();

        $storefrontImages = self::getStorefrontImages();

        $settingStore =  SettingStore::select('id','store_phone','store_email','store_address_1')->first();
---
select * from `setting_newsletters` limit 1
select `id`, `store_phone`, `store_email`, `store_address_1` from `setting_stores` limit 1

    private function getSettingData()
    {
        $settingsData = Setting::with(['translations'])
                        ->get()
                        ->keyBy('key');
---
select * from `settings`

    private function getFooterTags(string $tagIds)
    {
        $footerTagIds = json_decode($tagIds);

        $tags = [];
        if ($footerTagIds) {
            $tags = DB::table('tags')
                ->select([
                    'tags.id',
                    'tags.slug',
                    'tag_translations.tag_name'
                ])
                ->join('tag_translations', 'tags.id', '=', 'tag_translations.tag_id')
                ->where('tag_translations.local', 'en') // Fetch only 'en' translations
                ->whereIn('tags.id', $footerTagIds)
                ->where('tags.is_active', 1)
                ->orderBy('tags.is_active', 'DESC')
                ->orderBy('tags.id', 'DESC')
                ->get();
---
select `tags`.`id`, `tags`.`slug`, `tag_translations`.`tag_name` from `tags` inner join `tag_translations` on `tags`.`id` = `tag_translations`.`tag_id` where `tag_translations`.`local` = 'en' and `tags`.`id` in ('1', '2', '3', '4', '7') and `tags`.`is_active` = 1 order by `tags`.`is_active` desc, `tags`.`id` desc

    private function getStorefrontImages()
    {
        $storefrontImages = StorefrontImage::select('title','type','image')->get()->keyBy('title');
---
select `title`, `type`, `image` from `storefront_images`