app/Http/Controllers/API/HeaderController.php

    public function storefrontHeaderData()
    {
        $settingsData = Setting::with(['translations'])
                ->get()
                ->keyBy('key')
                ->map(function($setting){
                    return [
                        'id'             => $setting->id,
                        'key'            => $setting->key,
                        'plain_value'    => $setting->plain_value,
                        'is_translatable'=> $setting->is_translatable,
                        'locale' => $setting->translation->locale ?? null,
                        'value'  => $setting->translation->value ?? null,
                    ];
                });


        $settings = json_decode(json_encode($settingsData), FALSE);

        //Header Logo
        $storefrontImages = StorefrontImage::select('title','type','image')->get()->keyBy('title');
---
select * from `settings`
select `title`, `type`, `image` from `storefront_images`

    private function getCategoryMenuList()
    {
        $categories = Category::with(['translations','parentCategory','child'])
            ->where('is_active',1)
            ->orderBy('is_active','DESC')
            ->orderBy('id','ASC')
            ->get();
---
select * from `categories` where `is_active` = 1 and `categories`.`parent_id` in (1, 2, 3, 5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 28, 70, 71) and `categories`.`deleted_at` is null