app/Http/Controllers/API/HomeController.php

    public function index()
    {
        $sliders = self::getSliders();

        $settings = self::getSettingData();

        $sliderBanners = $this->getSliderBanner($settings);

        $storefrontImages = self::getStorefrontImages();

        $homeFooterDescription = FooterDescription::where('locale','en')->select('is_active','description')->first();
---
select `is_active`, `description` from `footer_descriptions` where `locale` = 'en' limit 1

    private function getSliders()
    {
        return DB::table('sliders')
        ->select([
            'sliders.id',
            'sliders.slider_slug',
            'sliders.type',
            'sliders.category_id',
            'sliders.url',
            'sliders.slider_image',
            'sliders.slider_image_full_width',
            'sliders.slider_image_secondary',
            'sliders.target',
            'sliders.text_alignment',
            'sliders.text_color',
            'sliders.is_active',
            'slider_translations.slider_title',
            'slider_translations.slider_subtitle'
        ])
        ->join('slider_translations', 'slider_translations.slider_id', '=', 'sliders.id')
        ->where('slider_translations.locale', 'en')
        ->orderBy('sliders.is_active', 'DESC')
        ->orderBy('sliders.id', 'ASC')
        ->get();
---
select `sliders`.`id`, `sliders`.`slider_slug`, `sliders`.`type`, `sliders`.`category_id`, `sliders`.`url`, `sliders`.`slider_image`, `sliders`.`slider_image_full_width`, `sliders`.`slider_image_secondary`, `sliders`.`target`, `sliders`.`text_alignment`, `sliders`.`text_color`, `sliders`.`is_active`, `slider_translations`.`slider_title`, `slider_translations`.`slider_subtitle` from `sliders` inner join `slider_translations` on `slider_translations`.`slider_id` = `sliders`.`id` where `slider_translations`.`locale` = 'en' order by `sliders`.`is_active` desc, `sliders`.`id` asc

    private function getSettingData()
    {
        $settingsData = Setting::with(['translations','storeFrontImage'])
                        ->get()
                        ->keyBy('key');
---
select * from `settings`
select * from `storefront_images` where `storefront_images`.`setting_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156)

    private function getStorefrontImages()
    {
        $storefrontImages = StorefrontImage::select('title','type','image')->get()->keyBy('title');
---
select `title`, `type`, `image` from `storefront_images`

    private function getOrderDetailsProduct()
    {
        $orderDetailProducts = OrderDetail::with([
            'product.translations',
            'orderProductTranslations',
            'baseImage',
            // 'additionalImage',
            // 'productAttributeValues.attributeTranslation',
            // 'productAttributeValues.attrValueTranslation'
        ])
        ->select('product_id')
        ->groupBy('product_id')
        ->selectRaw('SUM(qty) AS qty_of_sold')
        ->orderBy('qty_of_sold','DESC')
        ->skip(0)
        ->take(10)
        ->get()
        ->map(function($orderDetails){
            return [
                'productId' => $orderDetails->product_id,
                'name' => $orderDetails->product->translation->product_name,
                'slug' => $orderDetails->product->slug,
                'price' => $orderDetails->product->price,
                'isActive' => $orderDetails->product->is_active,
                'categoryId' => $orderDetails->product->categoryProduct[0]->category_id,
                'manageStock' => $orderDetails->product->manage_stock,
                'qty' => $orderDetails->product->qty,
                'inStock' => $orderDetails->product->in_stock,
                'newTo' => $orderDetails->product->new_to,
                'avgRating' => $orderDetails->product->avg_rating,
                'specialPrice' => $orderDetails->product->special_price,
                // 'mediumImage' => $orderDetails->baseImage->image_medium,
                'mediumImage' => file_exists(public_path($orderDetails->baseImage->image_medium)) ? asset($orderDetails->baseImage->image_medium) : 'https://dummyimage.com/180x40/12787d/ffffff&text=CartPro',
            ];
        });
---
select * from `product_translations` where `product_translations`.`product_id` in (1, 3, 4, 5, 6, 7, 8, 23, 25, 34) and `product_translations`.`deleted_at` is null
select * from `products` where `products`.`id` in (1, 3, 4, 5, 6, 7, 8, 23, 25, 34) and `products`.`deleted_at` is null
select `product_id`, SUM(qty) AS qty_of_sold from `order_details` where `order_details`.`deleted_at` is null group by `product_id` order by `qty_of_sold` desc limit 10 offset 0
select * from `category_product` where `category_product`.`product_id` = 3 and `category_product`.`product_id` is not null
select * from `products` where `products`.`id` in (1, 3, 4, 5, 6, 7, 8, 23, 34, 48) and `products`.`deleted_at` is null

    private function getProductTabsData($settings)
    {
        $productTabs = [];
        $categoryIds = [];

        for ($i=0; $i < 4; $i++) {
            $keyTitle = "storefront_product_tabs_1_section_tab_" . ($i + 1) . "_title";
            $keyProductType = "storefront_product_tabs_1_section_tab_" . ($i + 1) . "_product_type";
            $keyCategoryId = "storefront_product_tabs_1_section_tab_" . ($i + 1) . "_category_id";

            $productTabs[$i]['key'] = $keyTitle;
            $productTabs[$i]['title'] = $settings->$keyTitle->value ?? null;
            $productTabs[$i]['keyProductType'] = $settings->$keyProductType->plain_value ?? null;
            $productTabs[$i]['keyCategoryId'] = $settings->$keyCategoryId->plain_value ?? null;
            $categoryIds[] = $settings->$keyCategoryId->plain_value ?? null;
        }

        $categoryWithProducts = Category::with([
                                'translations',
                                'products.translations',
                                'products.baseImage',
                                'products.additionalImage'
                            ])
                            ->whereIn('id', $categoryIds)
                            ->get()
                            ->map(function($category){
                                return [
                                    'categoryId' => $category->id,
                                    'slug' => $category->slug,
                                    'isActive'  => $category->is_active,
                                    'categoryName' => $category->translation->category_name,
                                    'products' => $category->products->map(function($product){
                                        return [
                                            'productId' => $product->id,
                                            'name' => $product->translation->product_name,
                                            'slug' => $product->slug,
                                            'price' => $product->price,
                                            'manageStock' => $product->manage_stock,
                                            'qty' => $product->qty,
                                            'inStock' => $product->in_stock,
                                            'newTo' => $product->new_to,
                                            'avgRating' => $product->avg_rating,
                                            'specialPrice' => $product->special_price,
                                            'isActive' => $product->is_active,
                                            'image' => file_exists(public_path($product->baseImage->image)) ? asset($product->baseImage->image) :  'https://dummyimage.com/180x40/12787d/ffffff&text=CartPro',
                                            'mediumImage' => file_exists(public_path($product->baseImage->image_medium)) ? asset($product->baseImage->image_medium) : 'https://dummyimage.com/180x40/12787d/ffffff&text=CartPro',
                                        ];
                                    })
---
select * from `categories` where `id` in ('1', '2', '3', '5') and `categories`.`deleted_at` is null
select `products`.*, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`product_id` as `pivot_product_id` from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `category_product`.`category_id` in (1, 2, 3, 5) and `products`.`deleted_at` is null
select * from `products` where `products`.`id` in (1, 3, 4, 5, 6, 7, 8, 25, 34, 48) and `products`.`deleted_at` is null