app/Traits/Temporary/SettingHomePageSeoTrait.php

    public function settingHomePageSeo()
    {
        $setting_home_page_seo = [];
        $data_home_page  = SettingHomePageSeo::with('settingHomePageSeoTranslations')->get()
                                ->map(function($item){
                                    return [
                                        'id'               => $item->id,
                                        'meta_url'         => $item->meta_url ?? null,
                                        'meta_type'        => $item->meta_type ?? null,
                                        'meta_image'       => $item->meta_image ?? null,
                                        'locale'           => $this->translations($item->settingHomePageSeoTranslations)->locale ?? null,
                                        'meta_site_name'   => $this->translations($item->settingHomePageSeoTranslations)->meta_site_name ?? null,
                                        'meta_title'       => $this->translations($item->settingHomePageSeoTranslations)->meta_title ?? null,
                                        'meta_description' => $this->translations($item->settingHomePageSeoTranslations)->meta_description ?? null,
                                    ];
                                });
---
select * from `setting_home_page_seo_translations` where `locale` = 'en' or `locale` = 'en' and `setting_home_page_seo_translations`.`setting_home_page_seo_id` in (1)
select * from `setting_home_page_seos`