app/Http/Controllers/Frontend/BrandProductController.php

select * from `brands` where `is_active` = 1 order by `id` desc
---
    public function brands()
    {
        $brands = Cache::remember('brands', 150, function () {
            return Brand::where('is_active',1)
                    ->orderBy('id','DESC')
                    ->get();