app/Http/Controllers/Frontend/CategoryProductController.php

select * from `category_translations` where `category_translations`.`category_id` in (1) and `category_translations`.`deleted_at` is null
---
    public function categoryProductsFilterByAttributeValue(Request $request)
    {
        if(!Session::get('currentLocal')){
            Session::put('currentLocal', 'en');
            $locale = 'en';
        }else {
            $locale = Session::get('currentLocal');
        }
        App::setLocale($locale);

        $value_ids = array();
        $value_ids = explode(",",$request->attribute_value_ids);

        if (empty($request->attribute_value_ids)) {
            return response()->json(['type'=>'error']);
        }



        $category = Category::with('catTranslation','categoryTranslationDefaultEnglish','categoryProduct.product','categoryProduct.productTranslation','categoryProduct.productTranslationDefaultEnglish',
                            'categoryProduct.productBaseImage','categoryProduct.additionalImage','child.catTranslation','child.categoryTranslationDefaultEnglish')
                    ->where('slug',$request->category_slug)
                    ->first();

select * from `categories` where `slug` = 'mobile' and `categories`.`deleted_at` is null limit 1
select * from `category_product` where `category_product`.`category_id` in (1)
select * from `product_images` where `product_images`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 39, 40, 41, 42, 47, 48, 51, 54, 75, 76, 77, 78, 79, 80, 95)
select * from `products` where `products`.`id` in (1, 2, 3, 4, 5, 6, 7, 39, 40, 41, 42, 47, 48, 51, 54, 75, 76, 77, 78, 79, 80, 95) and `products`.`deleted_at` is null
---
    public function categoryWisePriceRangeProducts(Request $request)
    {

        if(!Session::get('currentLocal')){
            Session::put('currentLocal', 'en');
            $locale = 'en';
        }else {
            $locale = Session::get('currentLocal');
        }
        App::setLocale($locale);
        $CHANGE_CURRENCY_RATE = (env('USER_CHANGE_CURRENCY_RATE')!= NULL) ? env('USER_CHANGE_CURRENCY_RATE'): 1;

        $data = explode(" ",$request->amount);
        $data_amount_first = explode("$",$data[1]); //previous 0
        $data_amount_last = explode("$",$data[4]); //previous 2

        $min_price =  $data_amount_first[0]/$CHANGE_CURRENCY_RATE; //previous 1
        $max_price =  $data_amount_last[0]/$CHANGE_CURRENCY_RATE; //previous 1


        $locale = Session::get('currentLocal');

        $category = Category::with('catTranslation','categoryTranslationDefaultEnglish','categoryProduct.product','categoryProduct.productTranslation','categoryProduct.productTranslationDefaultEnglish',
                            'categoryProduct.productBaseImage','categoryProduct.additionalImage','child.catTranslation','child.categoryTranslationDefaultEnglish')
                    ->where('slug',$request->category_slug)
                    ->first();

        $products =  DB::table('products')
                ->join('product_translations', function ($join) use ($locale) {
                    $join->on('product_translations.product_id', '=', 'products.id')
                    ->where('product_translations.local', '=', $locale);
                })
                ->join('category_product', function ($join) use ($category) {
                    $join->on('category_product.product_id', '=', 'products.id')
                    ->where('category_product.category_id', '=', $category->id);
                })
                ->join('product_images', function ($join) {
                    $join->on('product_images.product_id', '=', 'products.id')
                    ->where('product_images.type', '=', 'base');
                })
                ->select('category_product.category_id','product_images.image','product_translations.product_name','product_translations.description','products.*')
                ->whereBetween('products.price', [$min_price, $max_price])
                ->get();