app/Http/Controllers/Frontend/CategoryProductController.php

    public function categoryWiseProducts($slug)
    {

        $setting = Setting::where('key','storefront_footer_tag_id')->first();
        $footer_tag_ids = json_decode($setting->plain_value);
        $tags = Tag::with('tagTranslations','tagTranslationEnglish')
                ->whereIn('id',$footer_tag_ids)
                ->where('is_active',1)
                ->orderBy('is_active','DESC')
                ->orderBy('id','DESC')
                ->get();


        $locale  = Session::get('currentLocal');

        $category = Category::with('catTranslation','categoryTranslationDefaultEnglish','categoryProduct.product','categoryProduct.productTranslation','categoryProduct.productTranslationDefaultEnglish',
                            'categoryProduct.productBaseImage','categoryProduct.additionalImage','child.catTranslation','child.categoryTranslationDefaultEnglish')
                    ->where('slug',$slug)
                    ->first();
---
select * from `category_translations` where `category_translations`.`category_id` in (1, 2, 3, 5, 7, 8, 11, 14, 15) and `category_translations`.`deleted_at` is null

    public function categoryProductsFilterByAttributeValue(Request $request)
    {
        if(!Session::get('currentLocal')){
            Session::put('currentLocal', 'en');
            $locale = 'en';
        }else {
            $locale = Session::get('currentLocal');
        }
        App::setLocale($locale);

        $value_ids = array();
        $value_ids = explode(",",$request->attribute_value_ids);

        if (empty($request->attribute_value_ids)) {
            return response()->json(['type'=>'error']);
        }



        $category = Category::with('catTranslation','categoryTranslationDefaultEnglish','categoryProduct.product','categoryProduct.productTranslation','categoryProduct.productTranslationDefaultEnglish',
                            'categoryProduct.productBaseImage','categoryProduct.additionalImage','child.catTranslation','child.categoryTranslationDefaultEnglish')
                    ->where('slug',$request->category_slug)
                    ->first();

        $products =  DB::table('products')
                ->join('product_translations', function ($join) use ($locale) {
                    $join->on('product_translations.product_id', '=', 'products.id')
                    ->where('product_translations.local', '=', $locale);
                })
                ->join('category_product', function ($join) use ($category) {
                    $join->on('category_product.product_id', '=', 'products.id')
                    ->where('category_product.category_id', '=', $category->id);
                })
                ->join('product_images', function ($join) {
                    $join->on('product_images.product_id', '=', 'products.id')
                    ->where('product_images.type', '=', 'base');
                })
                ->select('category_product.category_id','product_images.image','product_translations.product_name','product_translations.description','products.*')
                ->get()->toArray();
---
select * from `categories` where `slug` = 'mobile' and `categories`.`deleted_at` is null limit 1
select * from `category_translations` where `category_translations`.`category_id` in (1) and `category_translations`.`deleted_at` is null
select * from `product_translations` where `product_translations`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 48, 75, 76, 77, 78, 79, 80, 95) and `product_translations`.`deleted_at` is null
select * from `product_images` where `product_images`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 48, 75, 76, 77, 78, 79, 80, 95)