app/Http/Controllers/Frontend/CategoryProductController.php

select `products`.*, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`product_id` as `pivot_product_id` from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `category_product`.`category_id` = 9 and `products`.`deleted_at` is null
select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 5, 7, 8, 11, 14, 15) and `categories`.`deleted_at` is null
select `products`.*, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`product_id` as `pivot_product_id` from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `category_product`.`category_id` in (1, 2, 3, 5, 7, 8, 11, 14, 15) and `products`.`deleted_at` is null
---
    public function allCategogry()
    {
        $categoriesData = Category::with(['translations','childs.translations','products'])
                    ->where('parent_id', null)
                    ->orderBy('is_active','DESC')
                    ->orderBy('id','ASC')
                    ->get()
                    ->map(function($category) {
                        return [
                            'id'=> $category->id,
                            'image'=> isset($category->image) && file_exists(public_path($category->image)) ? asset($category->image) : 'https://dummyimage.com/50x50/000000/0f6954.png&text=Category',
                            'is_active'=> $category->is_active,
                            'icon'=> $category->icon,
                            'slug'=> $category->slug,
                            'totalProducts' => $category->products->count(),
                            'categoryName'=> $category->translation->category_name,
                            'childs'=> $category->childs->map(function($childCategory) {
                                return [
                                    'id'=> $childCategory->id,
                                    'image'=> isset($childCategory->image) && file_exists(public_path($childCategory->image)) ? asset($childCategory->image) : 'https://dummyimage.com/50x50/000000/0f6954.png&text=Category',
                                    'is_active'=> $childCategory->is_active,
                                    'icon'=> $childCategory->icon,
                                    'slug'=> $childCategory->slug,
                                    'totalProducts'=> $childCategory->products->count(),
                                    'childCategoryName'=> $childCategory->childTranslation->category_name,
                                ];
                            }),
                        ];
                    });

select * from `settings` where `key` = 'storefront_footer_tag_id' limit 1
select * from `tags` where `id` in ('1', '2', '3', '4', '7') and `is_active` = 1 and `tags`.`deleted_at` is null order by `is_active` desc, `id` desc
select `id`, `attribute_id`, `name` from `attribute_values` where `attribute_values`.`attribute_id` in (1, 2, 3, 26)
select `id`, `slug`, `name` from `attributes` where `is_active` = 1 and `attributes`.`deleted_at` is null
select * from `brands` where `brands`.`id` in (1, 2, 3)
select `id`, `attribute_id`, `name` from `attribute_values` where `attribute_values`.`attribute_id` in (1, 2, 26)
select `products`.*, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`product_id` as `pivot_product_id` from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `category_product`.`category_id` in (1) and `is_active` = 1 and `products`.`deleted_at` is null
select * from `categories` where `slug` = 'mobile' and `categories`.`deleted_at` is null limit 1
select `products`.*, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`product_id` as `pivot_product_id` from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `category_product`.`category_id` = 9 and `products`.`deleted_at` is null
---
    public function categoryWiseProducts($slug)
    {
        $setting = Setting::where('key','storefront_footer_tag_id')->first();

        $footer_tag_ids = json_decode($setting->plain_value);

        $tags = Tag::with('tagTranslations','tagTranslationEnglish')
                    ->whereIn('id',$footer_tag_ids)
                    ->where('is_active',1)
                    ->orderBy('is_active','DESC')
                    ->orderBy('id','DESC')
                    ->get();

        $locale  = Session::get('currentLocale');

        $attributes = Attribute::select('id','slug','name')
                    ->with('attributeValues:id,attribute_id,name')
                    ->where('is_active',1)
                    ->get();

        // New

        // DB::enableQueryLog();

        $category = Category::with([
            'translations',
            'childs.translations',
            'products' => function ($query) {
                $query->where('is_active', 1)
                ->with([
                    'translations',
                    'baseImage',
                    'additionalImage',
                    'brand',
                    'attributes' => function ($q) {
                        $q->select('id', 'name')
                          ->with(['attributeValues:id,attribute_id,name']);
                    }
                ]);
            },
        ])
        ->where('slug',$slug)
        ->first();

        // dd(DB::getQueryLog());

        $categoryWiseProducts =  (object) [
                'categoryId' => $category->id,
                'slug' => $category->slug,
                'isActive'  => $category->is_active,
                'categoryName' => $category->translation->category_name,
                'totalProducts' => $category->products->count(),
                'childs'=> $category->childs->map(function($childCategory) {
                    return [
                        'id'=> $childCategory->id,
                        'image'=> $childCategory->image,
                        'is_active'=> $childCategory->is_active,
                        'icon'=> $childCategory->icon,
                        'slug'=> $childCategory->slug,
                        'totalProducts'=> $childCategory->products->count(),
                        'childCategoryName'=> $childCategory->childTranslation->category_name,
                    ];
                }),
                'products' => $category->products->map(function($product){
                    return (object) [
                        'productId' => $product->id,
                        'name' => $product->translation->product_name,