app/Http/Controllers/Frontend/HomeController.php

select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 34, 35, 38, 40) and `categories`.`deleted_at` is null
---
    public function product_details(string $productSlug, $category_id)
    {
        $productDetailResult = Cache::remember('productDetailResult', 300, function () use ($productSlug) {
            $data = $this->productService->getProductBySlug($productSlug);
            return new ProductDetailsResource($data);
        });


        $product =  $productDetailResult->productDetails;
        $category =  $product->category;
        $attributes =  $product->attributes;


        $reviews =  $productDetailResult->reviews;
        $socialShareLinks =  $productDetailResult->socialShareLinks;
        $categoryWiseProducts = $productDetailResult->categoryWiseProducts->products;


        $productCartQty = null;
        $cart = Cart::content()->where('id',$product->basic->id)->where('options.category_id',$category_id ?? null)->first();

select * from `categories` where `categories`.`id` in (1) and `categories`.`deleted_at` is null
select * from `product_translations` where `local` = 'en' and `product_translations`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 39, 40, 41, 42, 47, 48, 51, 54, 75, 76, 77, 78, 79, 80, 95) and `product_translations`.`deleted_at` is null
select * from `products` where `products`.`id` in (1, 2, 3, 4, 5, 6, 7, 39, 40, 41, 42, 47, 48, 51, 54, 75, 76, 77, 78, 79, 80, 95) and `products`.`deleted_at` is null
---
    public function searchProduct(Request $request)
    {
        if (!$request->search) {
            return redirect()->back();
        }

        //KyWord Hit
        $dataCheck = KeywordHit::where('keyword',$request->search);
        if ($dataCheck->exists()) {
            $get_data = $dataCheck->first();
            $increment = $get_data->hit+1;
            $get_data->update(['hit'=>$increment]);
        }else {
            $keyword_hit = new KeywordHit();
            $keyword_hit->keyword = $request->search;
            $keyword_hit->hit = 1;
            $keyword_hit->save();
        }

        $locale = Session::get('currentLocale');
        $products = ProductTranslation::with(['product','product.baseImage'=> function($query){
                    return $query->where('type','base');
                },
                'product.categoryProduct','product.additionalImage'])
                ->where('product_name','LIKE', '%'.$request->search.'%')
                ->where('local',$locale)
                ->select('product_id','product_name','local')
                ->get();

        if($products->count()>0){