app/Http/Controllers/Frontend/HomeController.php

        });

        //CategoryProducts
        $category_products = Cache::remember('category_products', 300, function () {
            return CategoryProduct::with('product','productTranslation','productTranslationDefaultEnglish','productBaseImage','additionalImage','category','categoryTranslation','categoryTranslationDefaultEnglish',
                    'productAttributeValues.attributeTranslation','productAttributeValues.attributeTranslationEnglish',
                    'productAttributeValues.attrValueTranslation','productAttributeValues.attrValueTranslationEnglish')
                    ->get();
        });

        //Slider
        $sliders = Cache::remember('sliders', 300, function () use ($locale) {
            return Slider::with(['category','sliderTranslation'=> function ($query) use ($locale){
                $query->where('locale',$locale)
                ->orWhere('locale','en')
                ->orderBy('id','DESC');
            }])
            ->where('is_active',1)
            ->orderBy('is_active','DESC')
            ->orderBy('id','DESC')
            ->get();
        });
---
select * from `category_product`
select * from `product_attribute_value` where `product_attribute_value`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 39, 40, 41, 42, 43, 44, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95)
select * from `products` where `products`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 39, 40, 41, 42, 43, 44, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95) and `products`.`deleted_at` is null
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 34, 35, 38, 40) and `categories`.`deleted_at` is null

    public function searchProduct(Request $request)
    {
        if (!$request->search) {
            return redirect()->back();
        }

        //KyWord Hit
        $dataCheck = KeywordHit::where('keyword',$request->search);
        if ($dataCheck->exists()) {
            $get_data = $dataCheck->first();
            $increment = $get_data->hit+1;
            $get_data->update(['hit'=>$increment]);
        }else {
            $keyword_hit = new KeywordHit();
            $keyword_hit->keyword = $request->search;
            $keyword_hit->hit = 1;
            $keyword_hit->save();
        }

        $locale = Session::get('currentLocal');
        $products = ProductTranslation::with(['product','product.baseImage'=> function($query){
                    return $query->where('type','base');
                },
                'product.categoryProduct','product.additionalImage'])
                ->where('product_name','LIKE', '%'.$request->search.'%')
                ->where('local',$locale)
                ->select('product_id','product_name','local')
                ->get();
---
select * from `product_translations` where `product_translations`.`product_id` in (1, 3, 4, 5, 6, 7, 8, 25, 34, 48) and `product_translations`.`deleted_at` is null
select * from `products` where `products`.`id` in (1, 3, 4, 5, 6, 7, 8, 25, 34, 48) and `products`.`deleted_at` is null