app/Repositories/Attribute/AttributeRepository.php

    public function getAll()
    {
        $data = Attribute::with('attributeTranslations','attributeSetTranslations')
                ->orderBy('is_active','DESC')
                ->orderBy('id','DESC')
                ->get()
                ->map(function($attribute){
                    return [
                        'id'         =>$attribute->id,
                        'slug'       => $attribute->slug,
                        'attribute_set_id' => $attribute->attribute_set_id,
                        'is_filterable' => $attribute->is_filterable,
                        'is_active'  =>$attribute->is_active,
                        'locale'     => $this->translations($attribute->attributeTranslations)->locale ?? null,
                        'attribute_set_name'  => $this->translations($attribute->attributeSetTranslations)->attribute_set_name ?? null,
                        'attribute_name'  => $this->translations($attribute->attributeTranslations)->attribute_name ?? null,
                    ];
                });
---
select * from `attribute_set_translations` where (`locale` = 'en' or `locale` = 'en' and `attribute_set_translations`.`attribute_set_id` in (5, 10)) and `attribute_set_translations`.`deleted_at` is null
select * from `attribute_translations` where (`locale` = 'en' or `locale` = 'en' and `attribute_translations`.`attribute_id` in (1, 2, 3, 4, 26)) and `attribute_translations`.`deleted_at` is null
select * from `attributes` where `attributes`.`deleted_at` is null order by `is_active` desc, `id` desc