app/Models/Category.php

    public function getParentTranslationAttribute()
    {
        // Check if there is a parent category
        if (!$this->parentCategory) {
            return 'NONE';
        }

        $locale = Session::has('currentLocale') ? Session::get('currentLocale') : app()->getLocale();

        // Attempt to get the translation for the locale, or fallback to English
        $parentTranslation = $this->parentCategory->translations->firstWhere('locale', $locale) ?? $this->parentCategory->translations->firstWhere('locale', 'en');
---
select * from `categories` where `categories`.`parent_id` = 9 and `categories`.`parent_id` is not null and `categories`.`deleted_at` is null