app/Http/Controllers/Admin/FlashSaleController.php

    public function index()
    {
        $local = Session::get('currentLocal');

        $flashSales = FlashSale::with(['flashSaleTranslations'=> function ($query) use ($local){
            $query->where('local',$local)
            ->orWhere('local','en')
            ->orderBy('id','DESC');
        }])
        ->orderBy('is_active','DESC')
        ->orderBy('id','DESC')
        ->get();


        if (request()->ajax())
        {
            return datatables()->of($flashSales)
            ->setRowId(function ($row){
                return $row->id;
            })
            ->addColumn('campaign_name', function ($row) use ($local)
            {
                if ($row->flashSaleTranslations->count()>0){
                    foreach ($row->flashSaleTranslations as $key => $value){
                        if ($key<1){
                            if ($value->local==$local){
                                return $value->campaign_name;
                            }elseif($value->local=='en'){
                                return $value->campaign_name;
                            }
                        }
                    }
                }else {
                    return "NULL";
                }
            })
            ->addColumn('action', function ($row)
---
select * from `flash_sale_translations` where (`flash_sale_translations`.`flash_sale_id` in (2, 3, 10, 11) and `local` = 'en' or `local` = 'en') and `flash_sale_translations`.`deleted_at` is null order by `id` desc
select * from `flash_sales` where `flash_sales`.`deleted_at` is null order by `is_active` desc, `id` desc