app/Http/Controllers/Admin/ProfileController.php

    public function index()
    {
        $user = User::find(auth()->user()->id);
---
select * from `users` where `users`.`id` = 1 and `users`.`deleted_at` is null limit 1