app/Http/Controllers/Admin/ReviewController.php

    public function index()
    {
        $reviews = Review::with('user','product','productTranslation','productTranslationEnglish')->get();

        if (request()->ajax())
        {
            return datatables()->of($reviews)
            ->setRowId(function ($row){
                return $row->id;
            })
            ->addColumn('product_name', function ($row)
            {
                return $row->productTranslation->product_name ?? $row->productTranslationEnglish->product_name ?? null ;
            })
            ->addColumn('reviewer_name', function ($row)
            {
                return $row->user->first_name.' '.$row->user->last_name ?? null ;
            })
            ->addColumn('action', function ($row)
            {
                $actionBtn = "";
                if (auth()->user()->can('tag-edit'))
                {
                    $actionBtn .= '<button type="button" title="Edit" class="edit btn btn-info btn-sm" title="Edit" data-id="'.$row->id.'"><i class="dripicons-pencil"></i></button>
                    &nbsp; ';
                }
                return $actionBtn;
            })
            ->rawColumns(['action'])
            ->make(true);
---
select * from `reviews` where `reviews`.`deleted_at` is null
select * from `users` where `users`.`id` in (1, 49) and `users`.`deleted_at` is null